# ProductInstallType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..ProductInstallType Property
FabricationPart Class See Also
---
The product install type of the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string ProductInstallType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProductInstallType As String
	Get
```

Visual C++
---
```text
public:
property String^ ProductInstallType {
	String^ get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace